import orve from 'orve';

export default {
  /* router */
  main: "Главная",
  project: "Проект",
  component: "Компонент",
  event: "События (Event)",
  ref: "Реактивные переменные",
  refA: "Отрисовка списков",
  refC: "Реактивный компонент",
  effect: "Effect",
  refL: "Доступ к HTML Element",
  hooks: "Хуки жизненого цикла",
  watch: "Watch",
  fragment: "Фрагменты",
  cTag: "Кастомные теги",
  style: "Стили для тегов",
  async: "Асинхронный запрос",
  plugin: "Плагин",
  /* ------ */

  /* main | главная */
  main_message1: "Добро пожаловать в ORVE",
  main_message2: "Зачем нужен?",
  main_message3: "Библиотека нужна для создания SPA.",
  main_message4RU: ["Данная библиотека пытается предложить свой подход для реактивных библиотек.", <br />, "На данный момент библиотека развивается медленно, но Вы можете помочь мне и сообществу, которое будет ей пользоваться в будущем."],
  main_message5: "Как помочь?",
  main_message6: "Весь исходный код лежит на Github",
  main_message7: "Ссылка на webpack проект. Используйте его для разработки)",
  main_message8: "Ссылка на npm пакет",
  main_message9: "(GITHUB) Ссылка на эту документацию (сделано с помощью orve)"
  /* -------------- */
}